In [1]:
import pandas as pd
import seaborn as sns

In [2]:
df = pd.read_csv('data.csv')

In [3]:
df.head()

,job_title,hh_title,age,salary,exp. period,title of exp.
0,data analyst,Data analyst,22.0,NaN,2.67,Data Analyst
1,data analyst,Data Analyst,21.0,NaN,0.83,Junior Data Analyst
2,data analyst,Data Analyst,30.0,NaN,7.50,Data Analyst
3,data analyst,Data Analyst,24.0,NaN,4.92,Data Analyst
4,data analyst,Data Analyst,27.0,450000.0,3.25,Business Intelligence Analyst

In [4]:
b = df.drop(['hh_title', 'title of exp.'], axis=1)

In [13]:
b.head()

      job_title   age         salary  exp. period
0  data analyst  22.0  535354.761905         2.67
1  data analyst  21.0  535354.761905         0.83
2  data analyst  30.0  535354.761905         7.50
3  data analyst  24.0  535354.761905         4.92
4  data analyst  27.0  450000.000000         3.25

In [12]:
b.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 4 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   job_title    1000 non-null   object
 1   age          1000 non-null   float64
 2   salary       1000 non-null   float64
 3   exp. period  1000 non-null   float64
dtypes: float64(3), object(1)
memory usage: 31.4+ KB

In [11]:
b.isnull().sum()

job_title      0
age            0
salary         0
exp. period    0
dtype: int64

In [8]:
b['age'].fillna(b['age'].mean(), inplace=True)

In [9]:
b['salary'].fillna(b['salary'].mean(), inplace=True)

In [14]:
from sklearn.model_selection import train_test_split
X = b.drop('job_title', axis=1)
y = b['job_title']

In [15]:
X_train, X_test, y_train, y_test = train_test_split(X, y, test_size=0.2, random_state=42, stratify=y)

In [16]:
from sklearn.naive_bayes import GaussianNB
gnb = GaussianNB()
model = gnb.fit(X_train, y_train)

In [20]:
preds = gnb.predict(X_test)
print(preds)

['data engineer' 'data engineer' 'data engineer' 'data engineer'
 'data engineer' 'data engineer' 'data engineer' 'data engineer'
 'data engineer' 'sql' 'data engineer' 'data engineer' 'data engineer'
 'data engineer' 'data engineer' 'data engineer' 'data scientist'
 'data engineer' 'data engineer' 'data engineer' 'data engineer'
 'data engineer' 'data engineer' 'data engineer' 'sql' 'python'
 'data scientist' 'data engineer' 'data engineer' 'data engineer'
 'data engineer' 'data engineer' 'data engineer' 'data engineer' 'sql'
 'data engineer' 'data engineer' 'data engineer' 'data engineer' 'sql'
 'data engineer' 'data engineer' 'python' 'data engineer' 'data engineer'
 'data engineer' 'python' 'sql' 'python' 'data engineer' 'data engineer'
 'data engineer' 'python' 'data engineer' 'sql' 'python' 'data engineer'
 'data engineer' 'data engineer' 'python' 'data engineer' 'data engineer'
 'sql' 'data engineer' 'data engineer' 'python' 'data engineer'
 'data engineer' 'python' 'data engineer' 'data engineer' 'sql'
 'data engineer' 'data engineer' 'python' 'data engineer' 'data engineer'
 'data engineer' 'data engineer' 'python' 'data engineer' 'data engineer'
 'data engineer' 'data engineer' 'data engineer' 'data engineer' 'python'
 'sql' 'sql' 'data engineer' 'data engineer' 'python' 'data engineer'
 'data engineer' 'data engineer' 'data engineer' 'data engineer'
 'data engineer' 'python' 'data engineer' 'data engineer' 'data engineer'
 'data engineer' 'data engineer' 'sql' 'data engineer' 'data engineer'
 'python' 'sql' 'data engineer' 'python' 'data engineer' 'data engineer'
 'data engineer' 'data engineer' 'data engineer' 'data engineer'
 'data engineer' 'data engineer' 'data engineer' 'python' 'data engineer'
 'data engineer' 'python' 'sql' 'data engineer' 'data analyst'
 'data engineer' 'data engineer' 'data engineer' 'data engineer'
 'data engineer' 'python' 'data engineer' 'python' 'data engineer'
 'data engineer' 'data engineer' 'sql' 'data engineer' 'data engineer'
 'data engineer' 'data engineer' 'data engineer' 'data engineer'
 'data engineer' 'data engineer' 'data engineer' 'sql' 'data engineer'
 'data engineer' 'data engineer' 'data engineer' 'data engineer' 'python'
 'data engineer' 'data analyst' 'data engineer' 'data engineer'
 'data engineer' 'python' 'data engineer' 'data engineer' 'data engineer'
 'data engineer' 'data engineer' 'data engineer' 'data engineer'
 'data engineer' 'data engineer' 'python' 'data engineer' 'data engineer'
 'data engineer' 'data engineer' 'data engineer' 'python' 'data engineer'
 'data analyst' 'data engineer' 'data engineer' 'data engineer'
 'data engineer' 'data engineer' 'sql' 'sql' 'data engineer'
 'data engineer' 'data engineer' 'data engineer' 'data engineer' 'sql'
 'data engineer' 'data engineer' 'data engineer' 'data engineer'
 'data engineer' 'data engineer' 'data engineer' 'data engineer']

In [21]:
from sklearn.metrics import accuracy_score
print(accuracy_score(y_test,preds))

0.255

In [22]:
from sklearn.model_selection import cross_val_score

In [23]:
scores = cross_val_score(gnb, X_train, y_train, cv=10)
print("Cross-validation scores: {}".format(scores))

Cross-validation scores: [0.275  0.35   0.275  0.325  0.2875 0.2125 0.3125 0.3125 0.3375 0.225 ]

In [24]:
print("Average cross-validation score: {:.2f}".format(scores.mean()))

Average cross-validation score: 0.29

In [37]:
from sklearn.neighbors import KNeighborsClassifier
knn = KNeighborsClassifier(n_neighbors=3)
knn_model = knn.fit(X_train, y_train)

In [38]:
knn_preds = knn_model.predict(X_test)
print(knn_preds)
print(y_test)

['data analyst' 'python' 'python' 'python' 'data engineer' 'python'
 'python' 'data engineer' 'sql' 'data engineer' 'sql' 'data analyst'
 'python' 'sql' 'sql' 'sql' 'data scientist' 'sql' 'python'
 'data scientist' 'data analyst' 'data analyst' 'data scientist'
 'data engineer' 'data scientist' 'data scientist' 'data analyst' 'sql'
 'sql' 'sql' 'data scientist' 'data analyst' 'python' 'data analyst'
 'data scientist' 'data analyst' 'python' 'data engineer' 'sql'
 'data analyst' 'data scientist' 'data engineer' 'data analyst' 'sql'
 'data scientist' 'data scientist' 'sql' 'python' 'data scientist' 'sql'
 'data engineer' 'sql' 'data scientist' 'data engineer' 'data analyst'
 'data analyst' 'python' 'data scientist' 'data scientist' 'sql'
 'data scientist' 'data analyst' 'data engineer' 'data engineer' 'python'
 'python' 'python' 'sql' 'data analyst' 'data engineer' 'data analyst'
 'data engineer' 'data engineer' 'python' 'data engineer' 'data engineer'
 'python' 'data analyst' 'data analyst' 'data scientist' 'python'
 'data analyst' 'data scientist' 'data analyst' 'data analyst'
 'data engineer' 'sql' 'python' 'python' 'data engineer' 'data scientist'
 'data engineer' 'data engineer' 'data scientist' 'python' 'data engineer'
 'python' 'data engineer' 'data analyst' 'sql' 'python' 'data scientist'
 'sql' 'data scientist' 'python' 'python' 'data engineer' 'sql'
 'data engineer' 'sql' 'data engineer' 'sql' 'sql' 'sql' 'data analyst'
 'data engineer' 'sql' 'sql' 'data engineer' 'python' 'sql'
 'data engineer' 'python' 'data scientist' 'data scientist'
 'data scientist' 'data engineer' 'data engineer' 'sql' 'sql'
 'data scientist' 'sql' 'data scientist' 'sql' 'data engineer'
 'data analyst' 'data engineer' 'sql' 'data analyst' 'data analyst'
 'data analyst' 'data engineer' 'python' 'data analyst' 'sql' 'sql' 'sql'
 'data scientist' 'sql' 'data analyst' 'python' 'data analyst' 'sql'
 'data analyst' 'sql' 'data engineer' 'data engineer' 'python'
 'data analyst' 'sql' 'data engineer' 'python' 'python' 'python' 'sql'
 'data scientist' 'data scientist' 'python' 'data scientist'
 'data scientist' 'data analyst' 'data scientist' 'data analyst' 'sql'
 'data engineer' 'data scientist' 'python' 'data scientist' 'sql' 'python'
 'data engineer' 'python' 'data analyst' 'data engineer' 'sql'
 'data analyst' 'data scientist' 'data scientist' 'sql' 'python' 'sql'
 'sql' 'python' 'data scientist' 'data scientist' 'data engineer'
 'data engineer' 'data scientist' 'python' 'data analyst']
521     data engineer
737            python
740            python
660            python
411     data engineer
            ...
408     data engineer
332    data scientist
208    data scientist
613            python
78       data analyst
Name: job_title, Length: 200, dtype: object

In [39]:
accuracy = accuracy_score(y_test, knn_preds)

In [40]:
print(f'Accuracy: {accuracy}')

Accuracy: 0.83

In [41]:
scores = cross_val_score(knn, X_train, y_train, cv=10)
print("Cross-validation scores: {}".format(scores))

Cross-validation scores: [0.8    0.7625 0.8    0.7625 0.8875 0.825  0.7    0.8375 0.7125 0.85  ]

In [42]:
print("Average cross-validation score: {:.2f}".format(scores.mean()))

Average cross-validation score: 0.79